In [1]:
import pandas as pd
import sqlite3 as sql

In [2]:
%load_ext sql

In [3]:
cnn=sql.connect('HR.db')
%sql sqlite:///HR.db

In [38]:
%%sql
select * from job_history;
select * from employees;
select * from departments

 * sqlite:///HR.db
Done.
Done.
Done.

[('2', 'Architect Group', '30001', 'L0001'),
 ('5', 'Software Group', '30002', 'L0002'),
 ('7', 'Design Team', '30003', 'L0003')]

Retrieve the names and job start dates of all employees who work for department number 5.

In [10]:
%%sql
select f_name, l_name, start_date from employees e inner join job_history j on e.emp_id=j.empl_id where dept_id=5

 * sqlite:///HR.db
Done.

[('Alice', 'James', '01-08-2001'),
 ('Steve', 'Wells', '16-08-2001'),
 ('Santosh', 'Kumar', '16-08-2000'),
 ('Ann', 'Jacob', '16-08-2016')]

Retrieve employee ID, last name, department ID, and department name for all employees.

In [19]:
%%sql
select emp_id,l_name,dep_id,dep_name from employees e left join departments d on e.dep_id=d.dept_id_dep
-- select * from departments

 * sqlite:///HR.db
Done.

[('E1001', 'Thomas', '2', 'Architect Group'),
 ('E1002', 'James', '5', 'Software Group'),
 ('E1003', 'Wells', '5', 'Software Group'),
 ('E1004', 'Kumar', '5', 'Software Group'),
 ('E1005', 'Hussain', '2', 'Architect Group'),
 ('E1006', 'Allen', '2', 'Architect Group'),
 ('E1007', 'Thomas', '7', 'Design Team'),
 ('E1008', 'Gupta', '7', 'Design Team'),
 ('E1009', 'Jones', '7', 'Design Team'),
 ('E1010', 'Jacob', '5', 'Software Group')]

Retrieve the First name, Last name, and Department name of all employees.

In [23]:
%%sql
select f_name, l_name, dep_name from employees e full outer join departments d on e.dep_id=d.dept_id_dep

 * sqlite:///HR.db
Done.

[('John', 'Thomas', 'Architect Group'),
 ('Alice', 'James', 'Software Group'),
 ('Steve', 'Wells', 'Software Group'),
 ('Santosh', 'Kumar', 'Software Group'),
 ('Ahmed', 'Hussain', 'Architect Group'),
 ('Nancy', 'Allen', 'Architect Group'),
 ('Mary', 'Thomas', 'Design Team'),
 ('Bharath', 'Gupta', 'Design Team'),
 ('Andrea', 'Jones', 'Design Team'),
 ('Ann', 'Jacob', 'Software Group')]

# practice problems

Retrieve the names, job start dates, and job titles of all employees who work for department number 5.

In [32]:
%%sql
select f_name,l_name,start_date, job_title from employees e inner join jobs j inner join job_history h on e.job_id=j.job_ident and e.emp_id=h.empl_id where DEP_ID=5
-- select * from job_history

 * sqlite:///HR.db
Done.

[('Alice', 'James', '01-08-2001', 'Sr. Software Developer'),
 ('Steve', 'Wells', '16-08-2001', 'Jr.Software Developer'),
 ('Santosh', 'Kumar', '16-08-2000', 'Jr.Software Developer'),
 ('Ann', 'Jacob', '16-08-2016', 'Sr. Designer')]

Retrieve employee ID, last name, and department ID for all employees but department names for only those born before 1980.

In [39]:
%%sql
select emp_id,l_name,dep_id,DEP_NAME from employees e left outer join departments d on e.dep_id=d.DEPT_ID_DEP where strftime('%Y',substr(b_date,7,4)||'-'||substr(b_date,4,2)||'-'||substr(b_date,1,2) >'1980')

 * sqlite:///HR.db
Done.

[('E1001', 'Thomas', '2', 'Architect Group'),
 ('E1002', 'James', '5', 'Software Group'),
 ('E1003', 'Wells', '5', 'Software Group'),
 ('E1004', 'Kumar', '5', 'Software Group'),
 ('E1005', 'Hussain', '2', 'Architect Group'),
 ('E1006', 'Allen', '2', 'Architect Group'),
 ('E1007', 'Thomas', '7', 'Design Team'),
 ('E1008', 'Gupta', '7', 'Design Team'),
 ('E1009', 'Jones', '7', 'Design Team'),
 ('E1010', 'Jacob', '5', 'Software Group')]

Retrieve the first name and last name of all employees but department ID and department names only for male employees.

In [40]:
%%sql

SELECT E.F_NAME, E.L_NAME, D.DEPT_ID_DEP, D.DEP_NAME
FROM EMPLOYEES AS E
LEFT OUTER JOIN DEPARTMENTS AS D
ON E.DEP_ID=D.DEPT_ID_DEP AND E.SEX = 'M'
UNION
SELECT E.F_NAME, E.L_NAME, D.DEPT_ID_DEP, D.DEP_NAME
from EMPLOYEES AS E
RIGHT OUTER JOIN DEPARTMENTS AS D
ON E.DEP_ID=D.DEPT_ID_DEP AND E.SEX = 'M';

 * sqlite:///HR.db
Done.

[('Ahmed', 'Hussain', '2', 'Architect Group'),
 ('Alice', 'James', None, None),
 ('Andrea', 'Jones', None, None),
 ('Ann', 'Jacob', None, None),
 ('Bharath', 'Gupta', '7', 'Design Team'),
 ('John', 'Thomas', '2', 'Architect Group'),
 ('Mary', 'Thomas', None, None),
 ('Nancy', 'Allen', None, None),
 ('Santosh', 'Kumar', '5', 'Software Group'),
 ('Steve', 'Wells', '5', 'Software Group')]